cask_args appdir: "/Applications"

tap "thoughtbot/formulae"
tap "getantibody/tap"
tap "heroku/brew"

brew "mas"
brew "hivemind"
brew "tmux"
brew "zsh"
brew "neovim"
brew "direnv"
brew "chruby"
brew "ruby-install"
brew "nvm"
brew "postgresql"
brew "dnsmasq"
brew "dnscrypt-proxy"
brew "haproxy"
brew "caddy"
brew "fzf"
brew "ripgrep"
brew "httpie"
brew "git"
brew "hub"
brew "getantibody/tap/antibody"
brew "heroku/brew/heroku"
brew "parity", args: ["ignore-dependencies"]
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "tidy-html5"
brew "carthage"
brew "pandoc"
brew "jq"
brew "xsv"
brew "jo", args: ["HEAD"]
brew "fd"
brew "schollz/tap/croc"
brew "vale"

cask "1password"
cask "arq"
cask "basictex"
cask "betterzip"
cask "craftmanager"
cask "cyberduck"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-victor-mono"
cask "gitify"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "java8"
cask "keepingyouawake"
cask "monodraw"
cask "mullvadvpn"
cask "pgadmin4"
cask "postbox"
cask "sketch"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "ssh-tunnel-manager"
cask "transmission"
cask "vlc"

mas "Money",       id: 402410845
mas "Monosnap",    id: 540348655
mas "SnippetsLab", id: 1006087419
mas "Tomato One",  id: 907364780
mas "MindNode",    id: 1289197285
