cask_args appdir: "/Applications"

tap "thoughtbot/formulae"
tap "getantibody/tap"
tap "heroku/brew"
tap "caskroom/versions"

brew "hivemind"
brew "tmux"
brew "zsh"
brew "neovim"
brew "direnv"
brew "chruby"
brew "ruby-install"
brew "nvm"
brew "postgresql"
brew "dnsmasq"
brew "dnscrypt-proxy"
brew "haproxy"
brew "caddy"
brew "fzf"
brew "ripgrep"
brew "httpie"
brew "git"
brew "hub"
brew "getantibody/tap/antibody"
brew "heroku/brew/heroku"
brew "parity", args: ["--ignore-dependencies"]
brew "ctags"
brew "tidy-html5"
brew "carthage"
brew "pandoc"
brew "jq"
brew "xsv"

cask "1password"
cask "firefox"
cask "dropbox"
cask "spectacle"
cask "keepingyouawake"
cask "google-chrome"
cask "slack"
cask "transmission"
cask "iterm2"
cask "caskroom/fonts/font-firacode-nerd-font"
cask "arq"
cask "sketch"
cask "imageoptim"
cask "spotify"
cask "gitify"
cask "monodraw"
cask "postbox"
cask "java8"
cask "cyberduck"
cask "font-open-sans"
cask "font-overpass"
cask "skype"
cask "keka"
cask "vlc"
