cask_args appdir: "/Applications"

tap "thoughtbot/formulae"
tap "getantibody/tap"
tap "heroku/brew"

brew "tmux"
brew "zsh"
brew "neovim"
brew "direnv"
brew "chruby"
brew "ruby-install"
brew "nvm"
brew "postgresql"
brew "dnsmasq"
brew "dnscrypt-proxy"
brew "haproxy"
brew "caddy"
brew "fzf"
brew "ripgrep"
brew "httpie"
brew "git"
brew "hub"
brew "getantibody/tap/antibody"
brew "heroku/brew/heroku"
brew "parity", args: ["--ignore-dependencies"]

cask "1password"
cask "firefox"
cask "dropbox"
cask "spectacle"
cask "keepingyouawake"
cask "google-chrome"
cask "slack"
cask "transmission"
cask "iterm2"
cask "caskroom/fonts/font-firacode-nerd-font"
cask "arq"
cask "sketch"
cask "imageoptim"
